# Python Tutorials

### Data SQL equivalency

Solvertank Digital Science   
[http://www.solvertank.com](http://www.solvertank.com)   
<img src="cube.gif" align="left" width="50" />

See also:
https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html

## Setup

In [1]:
import pandas as pd
data = {'days': [12,53,45,11,23], 'age': [12,18,18,47,19], 'sex': ['M','F','M','M','F'], 'name': ['PEDRO ANDRADE','JOAO PEDRO ALMEIDA','CARLOS PEDRINO','MARIA SILVA','FERNANDO PEDRONAL']}
df = pd.DataFrame(data,columns= ['days', 'age', 'sex', 'name']) #pandas dataset

## Select

In [2]:
df #SELECT * FROM df

   days  age sex                name
0    12   12   M       PEDRO ANDRADE
1    53   18   F  JOAO PEDRO ALMEIDA
2    45   18   M      CARLOS PEDRINO
3    11   47   M         MARIA SILVA
4    23   19   F   FERNANDO PEDRONAL

In [3]:
df['days'] #SELECT days FROM df

0    12
1    53
2    45
3    11
4    23
Name: days, dtype: int64

In [4]:
df[['days','age']] #SELECT days, age FROM df

   days  age
0    12   12
1    53   18
2    45   18
3    11   47
4    23   19

In [5]:
df.head(3) #SELECT * FROM df LIMIT 3

   days  age sex                name
0    12   12   M       PEDRO ANDRADE
1    53   18   F  JOAO PEDRO ALMEIDA
2    45   18   M      CARLOS PEDRINO

In [6]:
df['days'].head(3) #SELECT days FROM df LIMIT 3

0    12
1    53
2    45
Name: days, dtype: int64

In [7]:
df['sex'].drop_duplicates().to_frame() #SELECT DISTINCT sex FROM df

  sex
0   M
1   F

In [ ]:
# Remove linhas duplicadas
def df_remove_duplicates(dff, key):
    dff = dff.sort_values(by=[key,'Data/hora de cadastro'], ascending=False) # ordena
    keys = dff[key]
    dff_dup = dff[keys.isin(keys[keys.duplicated()])]
    last_key = ''
    dup_rows = []
    for index, row in dff_dup.iterrows():
        if (last_key == row[key]):
            dup_rows.append(index)
        last_key = row[key]
    return dff.drop(dup_rows)

In [ ]:
# Mostra linhas duplicadas
def df_show_duplicates(dff, key):
    dff = dff.sort_values(by=[key,'Data/hora de cadastro'], ascending=False) # ordena
    keys = dff[key]
    dff_dup = dff[keys.isin(keys[keys.duplicated()])]
    return dff_dup

## Join

In [44]:
df1 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'abc'],'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'xyz'],'value': [5, 6, 7, 8]})

In [45]:
df1

   key  value
0  foo      1
1  bar      2
2  baz      3
3  abc      5

In [46]:
df2

   key  value
0  foo      5
1  bar      6
2  baz      7
3  xyz      8

In [48]:
# SELECT * UNION ALL
df1.append(df2)

   key  value
0  foo      1
1  bar      2
2  baz      3
3  abc      5
0  foo      5
1  bar      6
2  baz      7
3  xyz      8

In [11]:
# inner join (default)
pd.merge(df1, df2, on=['key'])

   key  value_x  value_y
0  foo        1        5
1  bar        2        6
2  baz        3        7

In [12]:
# left join
pd.merge(df1, df2, on=['key'], how='left')

   key  value_x  value_y
0  foo        1      5.0
1  bar        2      6.0
2  baz        3      7.0
3  abc        5      NaN

In [13]:
# right join
pd.merge(df1, df2, on=['key'], how='right')

   key  value_x  value_y
0  foo      1.0        5
1  bar      2.0        6
2  baz      3.0        7
3  xyz      NaN        8

In [14]:
# inner columns with different names
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'abc'],'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'xyz'],'value': [5, 6, 7, 8]})

In [15]:
# inner join (default)
pd.merge(df1, df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  bar        2  bar        6
2  baz        3  baz        7

## Order By

In [18]:
df.sort_values(by=['days']) #SELECT * FROM df ORDER BY days

   days  age sex                name
3    11   47   M         MARIA SILVA
0    12   12   M       PEDRO ANDRADE
4    23   19   F   FERNANDO PEDRONAL
2    45   18   M      CARLOS PEDRINO
1    53   18   F  JOAO PEDRO ALMEIDA

In [19]:
df.sort_values(by=['days', 'age'], ascending=False) #SELECT * FROM df ORDER BY days DESC

   days  age sex                name
1    53   18   F  JOAO PEDRO ALMEIDA
2    45   18   M      CARLOS PEDRINO
4    23   19   F   FERNANDO PEDRONAL
0    12   12   M       PEDRO ANDRADE
3    11   47   M         MARIA SILVA

## Where

In [20]:
df[df['sex']=='M'] #SELECT * FROM df WHERE sex='M'

   days  age sex            name
0    12   12   M   PEDRO ANDRADE
2    45   18   M  CARLOS PEDRINO
3    11   47   M     MARIA SILVA

In [21]:
df[(df['sex']=='M') | (df['sex']=='F')] #SELECT * FROM df WHERE sex='M' OR sex= 'F'

   days  age sex                name
0    12   12   M       PEDRO ANDRADE
1    53   18   F  JOAO PEDRO ALMEIDA
2    45   18   M      CARLOS PEDRINO
3    11   47   M         MARIA SILVA
4    23   19   F   FERNANDO PEDRONAL

In [22]:
df[(df['sex']=='M') & (df['sex']=='F')] #SELECT * FROM df WHERE sex='M' AND sex= 'F'

Empty DataFrame
Columns: [days, age, sex, name]
Index: []

In [23]:
df.loc[df['sex']=='M', 'days'] #SELECT days FROM df WHERE sex='M'

0    12
2    45
3    11
Name: days, dtype: int64

In [24]:
df.loc[df['sex']=='M', ['days','age']] #SELECT days, age FROM df WHERE sex='M'

   days  age
0    12   12
2    45   18
3    11   47

In [25]:
df[df['name'].str.contains('PEDR') == True] #SELECT * FROM df WHERE name LIKE '%PEDR%'

   days  age sex                name
0    12   12   M       PEDRO ANDRADE
1    53   18   F  JOAO PEDRO ALMEIDA
2    45   18   M      CARLOS PEDRINO
4    23   19   F   FERNANDO PEDRONAL

In [ ]:
df[df['name'].str.contains('PEDR') == False] #SELECT * FROM df WHERE name NOT LIKE '%PEDR%'

## Count

In [26]:
df['age'].count() #SELECT COUNT(age) FROM df

5

In [27]:
df.loc[df['sex']=='M','age'].count() #SELECT COUNT(age) FROM df WHERE sex='M'

3

## Count Group By
#SELECT age, COUNT(*) AS amount FROM df GROUP BY age

In [28]:
df['age'].value_counts()

18    2
47    1
12    1
19    1
Name: age, dtype: int64

In [29]:
df['age'].value_counts().to_frame()

    age
18    2
47    1
12    1
19    1

In [30]:
df['age'].value_counts().to_frame(name='amount').reset_index()

   index  amount
0     18       2
1     47       1
2     12       1
3     19       1

In [31]:
df.groupby('age').size()

age
12    1
18    2
19    1
47    1
dtype: int64

In [32]:
df.groupby('age').size().to_frame(name='amount').reset_index()

   age  amount
0   12       1
1   18       2
2   19       1
3   47       1

In [33]:
# group and count all columns
for column in df.columns:
    TB = df.groupby(column).size().to_frame(name = 'amount').reset_index()
    print("")
    print(TB)

   days  amount
0    11       1
1    12       1
2    23       1
3    45       1
4    53       1

   age  amount
0   12       1
1   18       2
2   19       1
3   47       1

  sex  amount
0   F       2
1   M       3

                 name  amount
0      CARLOS PEDRINO       1
1   FERNANDO PEDRONAL       1
2  JOAO PEDRO ALMEIDA       1
3         MARIA SILVA       1
4       PEDRO ANDRADE       1

In [34]:
# count values by label
def df_column_values(df, column, order_by_amount):
    dff = df.groupby(column).size().to_frame(name='amount').reset_index()
    if order_by_amount == 1:
        dff = dff.sort_values(by=['amount'], ascending=False)
    else:
        dff = dff.sort_values(by=[column], ascending=True)
    dff['percent'] = dff['amount']/df[column].count()
    return dff

In [35]:
df_column_values(df, 'age', 0)

   age  amount  percent
0   12       1      0.2
1   18       2      0.4
2   19       1      0.2
3   47       1      0.2

## Sum

In [36]:
df['days'].sum() #SELECT SUM(days) FROM df

144

In [37]:
df.loc[df['sex']=='M','days'].sum() #SELECT SUM(days) FROM df WHERE sex='M'

68

## Update

In [38]:
df['days'] = 90 #UPDATE df SET days=90

In [39]:
df.loc[df['sex'] == 'M', 'days'] = 90 #UPDATE df SET days=90 WHERE sex='M'

In [ ]:
df.iloc[3, df.columns.get_loc('days')] = 90 #UPDATE df SET days=90 WHERE rowno = 3

## Delete

In [40]:
df = df[df['sex']!='M'] #DELETE FROM df WHERE sex='M'

## Drop & rename column

In [41]:
df = df.drop(columns=['sex']) #ALTER TABLE df DROP COLUMN sex

In [42]:
df.rename(index=str, columns={'sex': 'sexo'}) #ALTER TABLE df RENAME COLUMN sex TO sexo

   days  age                name
1    90   18  JOAO PEDRO ALMEIDA
4    90   19   FERNANDO PEDRONAL

## Loop while

In [43]:
for index, row in df.iterrows():
    if index > 2: break
    print(str(index) + ': ' + str(row['days']))

1: 90

In [ ]:
for i in df.index:
    df.at[i, 'WP_days'] = 33